from handlers.language_check_handlers.database.new_tasks import add_new_task_optional

# Grammar

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Я … человек.\n\n1) добро\n2) доброта\n3) добрая\n4) добрый',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 4)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Я хочу поехать в Россию и тоже изучать ... .\n\n1) по-русски\n2) немецкий\n3) русский язык\n4) русские',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 3)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Меня ... Антон.\n\n1) фамилия\n2) зовут\n3) имя\n4) отец.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 2)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Мой родной ... - испанский.\n\n1) страна\n2) язык\n3) город\n4) народ.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 2)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Мое любимое время года - … .\n\n1) лето\n2) летом\n3) летний\n4) летние',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 1)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Мой друг очень хорошо говорит ... .\n\n1) по-русски\n2) русский\n3) русский язык\n4) русские.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 1)


add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Моя мама хорошо … суп.\n\n1) говорит\n2) готовит\n3) играет\n4) пишет',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 2)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Папа часто … газету вечером.\n\n1) читает\n2) слушает\n3) ест\n4) смотрит',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 1)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Мой друг ... в Москве.\n\n1) жить\n2) живёт\n3) живу\n4) живёте.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 2)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Сейчас зима, на улице … .\n\n1) тепло\n2) холодно\n3) жарко\n4) весело.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 2)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Михаил Николаевич - ... учитель.\n\n1) школа\n2) школьник\n3) школьница\n4) школьный.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 4)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Мой учитель говорит, что ...  - его второй дом.\n\n1) школа\n2) школьник\n3) школьница\n4) школьный.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 1)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'На столе лежит … .\n\n1) ручка\n2) ручки\n3) ручек\n4) ручку.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 1)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Я очень люблю … музыку.\n\n1) слушать\n2) пить\n3) читать\n4) готовить.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 1)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'По вечерам я ... телевизор.\n\n1) смотрю\n2) вижу\n3) читаю\n4) слушаю.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 1)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Самара -  … город на Волге.\n\n1) это\n2) этот\n3) эта\n4) эти.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 1)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Покажите … город на карте.\n\n1) это\n2) этот\n3) эта\n4) эти.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 2)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'У меня … книги.\n\n1) нет\n2) не.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 2)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'У меня нет … .\n\n1) книга\n2) книг\n3) книгу\n4) книгах.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 2)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'У него … машина.\n\n1) новый\n2) новая\n3) новые\n4) новое.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 2)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      '… , где вокзал?\n\n1) Извините\n2) Извинитесь\n3) Извини\n4) Извиняю.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 1)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Мне, …, чай.\n\n1) Простите\n2) Благодарю\n3) Пожалуйста\n4) Спасибо.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 3)

add_new_task_optional(1, 'A1', 'Easy', 'Grammar',
                      'Я люблю ... в футбол.\n\n1) бегать\n2) играть\n3) гулять\n4) смотреть',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 5, 2)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Я люблю отдыхать … на море.\n\n1) лето\n2) летом\n3) летний\n4) летние',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 2)


options_grammar_19 = [
    ("дом", False),
    ("дома", False),
    ("домой", False),
    ("домашний", True)
]

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Я  не знаю твой ...  телефон.\n\n1) дом\n2) дома\n3) домой\n4) домашний.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 4)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Мы родились и выросли в Москве. Москва - это …  город.\n\n1) наш\n2) наша\n3) наше\n4) наши.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 1)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Это … брат.\n\n1) мой\n2) моя\n3) моё\n4) мои.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 1)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Мои друзья ...  в университете.\n\n1) учатся\n2) учат\n3) занимаются\n4) изучают.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 1)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Мы с друзьями ... кино.\n\n1) любим\n2) любить\n3) любит\n4) любите.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 1)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Мой друг ... в Москве.\n\n1) жить\n2) живёт\n3) живу\n4) живёте.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 2)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Я часто  ... своему другу.\n\n1) помощь\n2) помогаю\n3) помогу\n4) помог',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 2)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Осенью в лесу очень … .\n\n1) красивый\n2) красавица\n3) красный\n4) красиво.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 4)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Зимой ... снег.\n\n1) идти\n2) идёт\n3) ходит\n4) едет.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 2)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Осенью ... дождь.\n\n1) идти\n2) идёт\n3) ходит\n4) едет.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 2)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Летом часто ... солнце.\n\n1) светит\n2) светить\n3) свети\n4) светят.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 1)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Алина Кабаева - гимнастка, она любит … .\n\n1) спорт\n2) спортсмен\n3) спортсменка\n4) спортивный.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 1)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Анна … в большой компании.\n\n1) работа\n2) работать\n3) работает\n4) работаю.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 3)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Я ... домашнее задание.\n\n1) делаю\n2) делать\n3) делает\n4) делайте.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 1)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Мы ... новые слова.\n\n1) учим\n2) учить\n3) учит\n4) учите.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 1)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Ольге очень … слушать современную популярную музыку,\n\n1) любит\n2) нравится\n3) хочет\n4) может.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 2)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Я часто ... в кафе с друзьями.\n\n1) делаю\n2) лежу\n3) стою\n4) хожу.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 4)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'В кафе мы обычно … чай.\n\n1) едим\n2) пьём\n3) смотрим\n4) пишем.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 2)

add_new_task_optional(1, 'A1', 'Middle', 'Grammar',
                      'Где ... остановка?\n\n1) ближний\n2) ближе\n3) ближайшая\n4) близко',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 7, 3)

add_new_task_optional(1, 'A1', 'Senior', 'Grammar',
                      'На каникулах я поеду отдыхать в деревню ... бабушке.\n\n1) о\n2) у\n3) к\n4) в',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 10, 3)

add_new_task_optional(1, 'A1', 'Senior', 'Grammar',
                      'Это мой дедушка, он уже … .\n\n1) студент\n2) мужчина\n3) пенсионер\n4) ребёнок.',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 10, 3)

add_new_task_optional(1, 'A1', 'Senior', 'Grammar',
                      '',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 10, )

add_new_task_optional(1, 'A1', 'Senior', 'Grammar',
                      '',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 10, )

add_new_task_optional(1, 'A1', 'Senior', 'Grammar',
                      '',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 10, )

add_new_task_optional(1, 'A1', 'Senior', 'Grammar',
                      '',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 10, )

add_new_task_optional(1, 'A1', 'Senior', 'Grammar',
                      '',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 10, )

add_new_task_optional(1, 'A1', 'Senior', 'Grammar',
                      '',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 10, )

add_new_task_optional(1, 'A1', 'Senior', 'Grammar',
                      '',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 10, )

add_new_task_optional(1, 'A1', 'Senior', 'Grammar',
                      '',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 10, )

add_new_task_optional(1, 'A1', 'Senior', 'Grammar',
                      '',
                      "Выберите верный вариант ответа из предложенных ниже",
                      'multiple_choice', 10, )