from handlers.language_check_handlers.database.new_tasks import add_new_task_optional_audio, add_new_task_audio

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'Здравствуйте! Я Мария. Мне 25 лет. Я работаю врачом.',
                      "Вопрос: Кто Мария по профессии?\n1) Учитель\n2) Врач\n3) Студент\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 2)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'Я родился в Новосибирске, но сейчас живу в Екатеринбурге.',
                      "Вопрос: Где он живёт сейчас?\n1) В Новосибирске\n2) В Москве\n3) В Екатеринбурге\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 3)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'Мой любимый предмет в школе — история, а не математика.',
                      "Вопрос: Какой его любимый предмет?\n\n1) Математика\n2) История\n3) География\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 2)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'Мой любимый цвет — синий. У меня есть сумка этого цвета.',
                      "Какой любимый цвет рассказчика?\n\n1) Красный\n2) Синий\n3) Зелёный\n\nНапиши ТОЛЬКО цифру ответа!",
                      'multiple_choice', 5, 2)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'У меня есть собака и кошка. Собаку зовут Рекс, кошку — Мурка.',
                      "Как зовут кошку?\n\n1) Рекс\n2) Мурка\n3) Белка\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 2)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'Моя мама работает врачом, а папа — инженером.',
                      "Вопрос: Кто инженер в семье?\n\n1) Мама\n2) Папа\n3) Я\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 2)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'У нас дома живёт кошка и собака.',
                      "Вопрос: Сколько животных у них дома?\n\n1) Два\n2) Одно\n3) Три\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 1)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'У меня есть сестра и брат. Сестру зовут Оля, брата — Иван.',
                      "Вопрос: Как зовут брата?\n\n1) Иван\n2) Оля\n3) Сергей\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 2)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'В моей семье пять человек: папа, мама, я, младший брат и старшая сестра.',
                      "Вопрос: Сколько человек в семье?\n\n1) 3\n2) 4\n3) 5\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 3)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'Мою бабушку зовут Ольга Ивановна, а дедушку — Александр Петрович.',
                      "Вопрос: Как зовут мужчину?\n\n1) Ольга Ивановна\n2) Пётр Александрович\n3)  Александр Петрович\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 3)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'Мой папа работает врачом, а мама — учительница в школе.',
                      "Вопрос: Где работает женщина?\n\n1) В школе\n2) В банке\n3) В больнице\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 1)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'Моего лучшего друга зовут Дмитрий, но все называют его Дима.',
                      "Вопрос: Как зовут лучшего друга?\n\n1) Алексей\n2) Дмитрий\n3) Михаил.\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 2)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'Завтра будет солнечно и тепло.',
                      "Вопрос: Какая погода завтра?\n\n1)Солнечно и тепло\n2)Дождь\n3)Снег\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 1)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      '— Алло! Это школа?— Да, это школа номер 12.',
                      "Вопрос: Что это за учреждение?\n\n1) Магазин\n2) Больница\n3) Школа\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 3)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      'Моя мама работает в больнице. Она лечит людей.',
                      "Вопрос: Где работает мама?\n\n1) В магазине\n2) В школе\n3) В больнице\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 3)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      '— Сколько стоит билет?— Сто рублей.',
                      "Вопрос: Сколько стоит билет?\n\n1) 100 рублей\n2) 200 рублей\n3) 10 рублей\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 1)

add_new_task_optional_audio(1, 'A1', 'Easy', 'Listening',
                      '8:13 - Биология',
                      "Прослушайте расписание и отметьте правильное время пары.\n\n1)8:30\n2)18:30\n3)8:13\n4)18:13\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 5, 3)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'Мне 22 года. Мой день рождения 10 октября.',
                      "Вопрос: Когда у него день рождения?\n\n1) 10 сентября\n2) 10 октября\n3) 10 ноября\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 2)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'По вечерам я люблю читать книги или смотреть фильмы.',
                      "Вопрос: Что он НЕ любит делать по вечерам?\n\n1) Гулять\n2) Читать книги\n3) Смотреть фильмы\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 1)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'У меня есть дядя. Он брат моего отца.',
                      "Вопрос: Кто такой дядя?\n\n1) Брат отца\n2) Брат матери\n3) Отец отца\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 1)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'Мы живём в большой квартире: в ней три комнаты и кухня.',
                      "Вопрос: Сколько комнат в квартире?\n\n1) 2\n2) 3\n3) 4\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 2)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'Сегодня днём будет дождь и сильный ветер, а завтра снова солнечно.',
                      "Выберите верное утверждение..\n\n1) Сегодня будет дождь и ветер, завтра солнечно.\n2) Завтра будет дождь и ветер.\n3) Сегодня солнечно, завтра дождь.\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 1)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'Летом я всегда ношу шляпу. Солнце очень яркое, и без шляпы может заболеть голова.',
                      "Вопрос: Почему летом он носит шляпу?\n\n1) Чтобы было модно\n2) Чтобы солнце не светило в глаза\n3) Чтобы не болела голова\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 3)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'Сегодня холодно. Надень шапку и куртку.',
                      "Вопрос: Что надеть на голову?\n\n1) Куртку\n2) Шапку\n3) Шлёпки\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 2)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'Ура! Сегодня тепло, можно надеть футболку.',
                      "Вопрос: Что можно надеть?\n\n1) Пальто\n2) Футболку\n3) Варежки\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 2)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'Мой брат — инженер. Он работает на большом заводе.',
                      "Вопрос: Кто по профессии брат?\n\n1) Врач\n2) Учитель\n3) Инженер\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 3)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'Мой телефон — 5 6 3 9.',
                      "Задание: Запишите номер телефона\n\nНапиши все цифры без пробелов и пропусков",
                      'multiple_choice', 7, 5639)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'По вечерам я обычно отдыхаю: смотрю телевизор или разговариваю с друзьями по телефону.',
                      "Вопрос: Чем он НЕ занимается по вечерам?\n\n1) Отдыхает\n2) Работает\n3) Смотрит телевизор\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 2)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'Мой друг любит играть в футбол. А я не люблю спорт, я предпочитаю смотреть сериалы.',
                      "Вопрос: Что любит делать автор текста?\n\n1) Играть в футбол\n2) Смотреть сериалы\n3) Заниматься спортом\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 2)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'У меня есть два хобби: фотография и рисование. Но рисовать я люблю больше.',
                      "Вопрос: Какое хобби ему нравится больше?\n\n1) Фотография\n2) Рисование\n3) Спорт\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 2)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'Каждое воскресенье мы с друзьями играем в настольные игры. Иногда мы ходим в кафе.',
                      "Вопрос: Что они делают каждое воскресенье?\n\n1) Играют в настольные игры\n2) Ходят в кино\n3) Сидят дома\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 2)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      '— Здравствуйте! Можно меню, пожалуйста?— Конечно. Что будете пить?— Кофе, пожалуйста.',
                      "Вопрос: Где находятся люди?\n\n1) В магазине\n2) В школе\n3) В кафе\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 3)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      '— Скажите, пожалуйста, как пройти к библиотеке?— Идите прямо и налево.',
                      "Вопрос: Куда нужно повернуть?\n\n1) Направо\n2) Налево\n3) Назад\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 7, 2)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'Мой адрес - улица Ленина, дом 15, квартира 7.',
                      "Задание: Напишите ТОЛЬКО номер квартиры.",
                      'multiple_choice', 7, 7)

add_new_task_optional_audio(1, 'A1', 'Middle', 'Listening',
                      'У нас занятие в 102 аудитории',
                      " Напишите только номер аудитории, в которой у вас пара.",
                      'multiple_choice', 7, 102)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'В прошлые выходные мы с Антоном ходили в кино на новый фильм.',
                      "Вопрос: С кем он ходил в кино?\n\n1) С Мариной\n2) С Антоном\n3) С семьёй\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 2)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Моя подруга Катя учится в одной школе со мной, а с Мариной мы познакомились на танцах.',
                      "Вопрос: Кто учится с рассказчиком в школе?\n\n1) Катя\n2) Оля\n3) Мария\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 2)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Моя подруга Маша очень занята. У неё сегодня урок английского, а потом она идёт к врачу.',
                      "Вопрос: Куда Маша идёт ПОСЛЕ урока?\n\n1) Домой\n2) На работу\n3) К врачу\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 3)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Петя и Аня — мои друзья. Петя живёт в соседнем доме, а Аня — в другом районе.',
                      "Вопрос: Кто живёт дальше?\n\n1) Аня\n2) Петя\n3) Они живут рядом\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 1)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Мы с другом любим смотреть разные сериалы. Я люблю комедии, а он — детективы.',
                      "Вопрос: Что любит смотреть его друг?\n\n1) Комедии\n2) Детективы\n3) Мультфильмы\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 2)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'У моего друга Саши сегодня плохое настроение. Он получил плохую оценку по математике.',
                      "Вопрос: Почему у Саши плохое настроение?\n\n1) Он заболел\n2) Он устал\n3) Он получил двойку\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 3)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Мой друг Андрей не любит шумные вечеринки. Он любит тишину и спокойные разговоры.',
                      "Вопрос: Что любит Андрей?\n\n1)Громкую музыку\n2)Шумные вечеринки\n3)  Тихие разговоры\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 3)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Я не взял зонт, потому что утром было солнце. А сейчас по радио сказали, что вечером будет гроза.',
                      "Вопрос: Что будет вечером?\n1) Будет солнце\n2) Будет гроза\n3) Будет ветер\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 2)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Моя мама работает в банке. Каждый день она начинает работать в 9 утра, а заканчивает в 6 вечера. Она никогда не работает в выходные.',
                      "Вопрос: Когда мама НЕ работает?\n\n1) В среду\n2) В субботу и воскресенье\n3) В пятницу вечером\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 2)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Антон — повар. Он работает в маленьком ресторане. Его работа очень трудная, но интересная.',
                      "Вопрос: Где работает Антон?\n\n1) В большом ресторане\n2) В маленьком кафе\n3) В маленьком ресторане\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 3)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'У нас уроки начинаются в 8:30, а заканчиваются в 14:00.',
                      "Вопрос: Во сколько заканчиваются уроки?\n\n1) В 8:30\n2) В 18:30\n3) В 14:00\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 3)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Сегодня 8 мая. Завтра у Анны экзамен в 9 часов утра.',
                      "Вопрос: Какое сегодня число?\n\n1) 8 мая\n2) 8 марта\n3) 18 мая\n4) 18 марта\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 1)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Внимание! Поезд до Москвы отправляется в 18 часов 45 минут с третьего пути.',
                      "Во сколько отправляется поезд?\n\n1) В 8:45\n2) В 18:45\n3) В 16:45\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 2)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Сегодня 15 декабря. На улице холодно, идёт снег.',
                      "Вопрос: Какое сегодня число?\n\n1) 15 декабря\n2) 15 ноября\n3) 5 декабря\n4) 25 декабря\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 1)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Сегодня 8 мая. Завтра у Анны экзамен в 9 часов.',
                      "Вопрос: Во сколько у Анны завтра экзамен?\n\n1) В 9 часов\n2) В 10 часов\n3) Нет информации\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 1)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Внимание! Автобус до Москвы поедет в 14 часов 30 минут.',
                      "Выберите верное утверждение.\n\n1) Автобус в Москву уезжает в 14:30.\n2) Поезд в Москву уходит завтра утром.\n3) Автобус в Москву уходит вечером в 18:30.\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 1)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'В субботу в 19:00 в нашем клубе концерт джазовой музыки.',
                      "Выберите верное утверждение.\n\n1) Концерт джазовой музыки будет в субботу вечером в клубе.\n2) Сегодня вечером в клубе будет рок-концерт.\n3) В воскресенье утром в клубе состоится концерт классической музыки.\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 1)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Мария приедет в Москву 12 мая и останется там на неделю.',
                      "Выберите верное утверждение.\n\n1) Мария приезжает в Москву 12 мая и будет там неделю.\n2) Мария уезжает в Москву 20 мая и остаётся там на месяц.\n3) Мария приезжает в Москву завтра и останется там два дня.\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 1)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Летом я всегда езжу на море. Я плаваю и загораю на пляже.',
                      "Вопрос: Что он делает на пляже?\n\n1) Катается на лыжах\n2) Гуляет по городу\n3)Плавает и загорает\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 3)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Я купил билеты на концерт на субботу. А мой брат купил билеты в музей.',
                      "Вопрос: Куда пойдет автор текста в субботу?\n\n1) На концерт\n2) В музей\n3) В кино\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 1)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Внимание! Поезд до Москвы отправляется в 18:45 с третьего пути.',
                      "Вопрос: Куда едет поезд?\n\n1) В Мурманскn2) В Калиниград\n3) В Москву\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 3)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Внимание! Самолёт до Парижа вылетает в 14 часов 30 минут.',
                      "Вопрос: Куда летит самолёт?\n\n1) В Лондон\n2) В Париж\n3) В Москву\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 2)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Завтра в 10 утра в библиотеке будет встреча со знаменитым писателем.',
                      "Выберите верное утверждение.\n\n1)Сегодня вечером в библиотеке встреча с актёром. \n2) Встреча с писателем состоится завтра в 10 утра в библиотеке.\n3) Встреча со студентами будет завтра вечером в библиотеке.\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 2)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Наш музей работает каждый день с 10 утра до 6 вечера, кроме понедельника',
                      "Выберите верное утверждение.\n\n1) Музей работает с 10 до 18, кроме понедельника.\n2) Музей открыт только по понедельникам.\n3) Музей работает круглосуточно.\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 1)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Выключите телевизор! Он мешает спать!',
                      "Прослушайте аудио и определите, что мешает соседу.\n\n1) Музыка\n2) Телевизор\n3) Телефон\n4) Радио\n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 2)

add_new_task_optional_audio(1, 'A1', 'Senior', 'Listening',
                      'Меня злит, потому что ты не убираешь за собой. Из-за этого мне нужно убирать за двух людей',
                      " Почему сосед злится?\n\n1)Потому что я долго моюсь\n2)Потому что я много разговариваю по телефону\n3) Потому что я громко смотрю телевизор\n4) Потому что я не убираю за собой \n\nНапиши ТОЛЬКО номер ответа!",
                      'multiple_choice', 9, 4)