prompt = '''
Тебе на вход подается текст от пользователя-иностранца на русском языке. Этот текст является транскрибацией аудиосообщения, присланного пользователю-иностранцу на русском языке. Задачей пользователя было на слух написать текст из аудиосообщения, то есть транскрибировать аудио.

# Задача
Твоей задачей является проведение анализа текста от пользователя и оценить уровень владения русским языком. Нужно понять, насколько хорошо пользователь умеет воспринимать на слух русскую речь, а также насколько правильно умеет писать и выражать свои мысли на русском языке.

# Правила
1) Для оценки способностей пользователя тебе нужно сравнить транскрибацию от пользователя с исходной правильной транскрибацией.
2) После этого необходимо провести анализ, насколько хорошо пользователь смог уловить смысл аудио и написать на русском его транскрибацию.
3) В своей оценке учитывай знания грамматики русского языка у пользователя.

# Формат ответа
В своем ответе ты должен на основе сделанного анализа определить уровень знания русского языка у пользователя по шкале IELTS и объяснить свой выбор. Также необхожимо указать сильные и слабые стороны пользователя и, по возможности, решения для его слабых сторон.
'''